package les09_03;

/*
 * Создать объект класса Государство, используя классы Область, Район, Город.
 * Методы: вывести на консоль столицу, количество областей, площадь, областные центры.
 */
public class Main {
	City[] citys = {new City("1"),
             new City("2"),
             new City("3"),
             new City("4"),
             new City("5"),
           
     System.out.println(StateLogic.getStateInfo(1));
}
